Masmiseim36/nxpSDK/boards/evkmimxrt1010/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_09 (number 3), LPUART1_RXD/J56[2] */
/* Routed pin properties */
#define BOARD_INITLPUART_UART1_RXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITLPUART_UART1_RXD_SIGNAL                                    RXD   /*!< Signal name */

/* GPIO_10 (number 2), LPUART1_TXD/J56[4] */
/* Routed pin properties */
#define BOARD_INITLPUART_UART1_TXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define BOARD_INITLPUART_UART1_TXD_SIGNAL                                    TXD   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLPUART(void);

#define BOARD_INITLED_IOMUXC_GPR_GPR26_GPIO_SEL_MASK 0x0800U /*!< Select GPIO1 or GPIO2: affected bits mask */

/* GPIO_11 (number 1), GPIO_11 */
/* Routed pin properties */
#define BOARD_INITLED_GPIO_11_PERIPHERAL                                   GPIO1   /*!< Peripheral name */
#define BOARD_INITLED_GPIO_11_SIGNAL                                  gpiomux_io   /*!< Signal name */
#define BOARD_INITLED_GPIO_11_CHANNEL                                        11U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLED(void);

#define BOARD_INITBUTTON_IOMUXC_GPR_GPR26_GPIO_SEL_MASK 0x20U /*!< Select GPIO1 or GPIO2: affected bits mask */

/* GPIO_SD_05 (number 70), USER_BUTTON */
/* Routed pin properties */
#define BOARD_INITBUTTON_USER_BUTTON_PERIPHERAL                            GPIO2   /*!< Peripheral name */
#define BOARD_INITBUTTON_USER_BUTTON_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITBUTTON_USER_BUTTON_CHANNEL                                  5U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTON_USER_BUTTON_GPIO                                  GPIO2   /*!< GPIO peripheral base pointer */
#define BOARD_INITBUTTON_USER_BUTTON_GPIO_PIN                                 5U   /*!< GPIO pin number */
#define BOARD_INITBUTTON_USER_BUTTON_GPIO_PIN_MASK                    (1U << 5U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTON(void);

/* GPIO_AD_01 (number 59), ADC12_1/J26[10]/J56[14] */
/* Routed pin properties */
#define BOARD_INITADC_ADC12_1_PERIPHERAL                                    ADC1   /*!< Peripheral name */
#define BOARD_INITADC_ADC12_1_SIGNAL                                          IN   /*!< Signal name */
#define BOARD_INITADC_ADC12_1_CHANNEL                                         1U   /*!< Signal channel */

/* GPIO_AD_02 (number 58), ADC12_2/J26[12]/J56[16] */
/* Routed pin properties */
#define BOARD_INITADC_ADC12_2_PERIPHERAL                                    ADC1   /*!< Peripheral name */
#define BOARD_INITADC_ADC12_2_SIGNAL                                          IN   /*!< Signal name */
#define BOARD_INITADC_ADC12_2_CHANNEL                                         2U   /*!< Signal channel */

/* GPIO_AD_07 (number 51), ADC12_3/J26[2] */
/* Routed pin properties */
#define BOARD_INITADC_ADC12_3_PERIPHERAL                                    ADC1   /*!< Peripheral name */
#define BOARD_INITADC_ADC12_3_SIGNAL                                          IN   /*!< Signal name */
#define BOARD_INITADC_ADC12_3_CHANNEL                                         7U   /*!< Signal channel */

/* GPIO_AD_09 (number 48), ADC12_4/JTAG_TDO/J55[6]/J26[4] */
/* Routed pin properties */
#define BOARD_INITADC_ADC12_4_PERIPHERAL                                    ADC1   /*!< Peripheral name */
#define BOARD_INITADC_ADC12_4_SIGNAL                                          IN   /*!< Signal name */
#define BOARD_INITADC_ADC12_4_CHANNEL                                         9U   /*!< Signal channel */

/* GPIO_AD_10 (number 47), ADC12_5/JTAG_TDI/J55[8]/J26[6] */
/* Routed pin properties */
#define BOARD_INITADC_ADC12_5_PERIPHERAL                                    ADC1   /*!< Peripheral name */
#define BOARD_INITADC_ADC12_5_SIGNAL                                          IN   /*!< Signal name */
#define BOARD_INITADC_ADC12_5_CHANNEL                                        10U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC(void);

/* GPIO_02 (number 11), I2C1_SCL/U10[17]/J57[20]/U26[4] */
/* Routed pin properties */
#define BOARD_INITPWM_I2C1_SCL_PERIPHERAL                                   PWM1   /*!< Peripheral name */
#define BOARD_INITPWM_I2C1_SCL_SIGNAL                                          A   /*!< Signal name */
#define BOARD_INITPWM_I2C1_SCL_CHANNEL                                        0U   /*!< Signal channel */

/* GPIO_01 (number 12), I2C1_SDA/U10[18]/J57[18]/U26[6] */
/* Routed pin properties */
#define BOARD_INITPWM_I2C1_SDA_PERIPHERAL                                   PWM1   /*!< Peripheral name */
#define BOARD_INITPWM_I2C1_SDA_SIGNAL                                          B   /*!< Signal name */
#define BOARD_INITPWM_I2C1_SDA_CHANNEL                                        0U   /*!< Signal channel */

/* GPIO_04 (number 9), SAI1_TXD0/U10[14] */
/* Routed pin properties */
#define BOARD_INITPWM_SAI1_TXD0_PERIPHERAL                                  PWM1   /*!< Peripheral name */
#define BOARD_INITPWM_SAI1_TXD0_SIGNAL                                         A   /*!< Signal name */
#define BOARD_INITPWM_SAI1_TXD0_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_03 (number 10), SAI1_RXD0/U10[16] */
/* Routed pin properties */
#define BOARD_INITPWM_SAI1_RXD0_PERIPHERAL                                  PWM1   /*!< Peripheral name */
#define BOARD_INITPWM_SAI1_RXD0_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_SAI1_RXD0_CHANNEL                                       1U   /*!< Signal channel */

/* GPIO_05 (number 8), SAI1_TXD1 */
/* Routed pin properties */
#define BOARD_INITPWM_SAI1_TXD1_PERIPHERAL                                  PWM1   /*!< Peripheral name */
#define BOARD_INITPWM_SAI1_TXD1_SIGNAL                                         B   /*!< Signal name */
#define BOARD_INITPWM_SAI1_TXD1_CHANNEL                                       2U   /*!< Signal channel */

/* GPIO_06 (number 6), SAI1_TX_BCLK/U10[12] */
/* Routed pin properties */
#define BOARD_INITPWM_SAI1_TX_BCLK_PERIPHERAL                               PWM1   /*!< Peripheral name */
#define BOARD_INITPWM_SAI1_TX_BCLK_SIGNAL                                      A   /*!< Signal name */
#define BOARD_INITPWM_SAI1_TX_BCLK_CHANNEL                                    2U   /*!< Signal channel */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPWM(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
